# Портфолио QA Engineer | Екатерина Татаринова
Привет! Меня зовут Екатерина, я начинающий QA Engineer с техническим бэкграундом в телекоммуникациях. Это портфолио содержит пример моих работ по тестированию.
## Обо мне
- **Образование:** Радиотехника, Иркутский национальный исследовательский технический университет
- **7+** лет опыта работы с технической документацией, данными и процессами контроля качества
- **Цель:** Стать Junior QA Engineer и развиваться в сфере тестирования ПО
- **Контакты:** katysaynsk@yandex.ru | [Мое резюме на HH](https://novosibirsk.hh.ru/resume/236dbe0cff029aa2b90039ed1f304342317574)  
## Технические навыки
  - **Ручное тестирование:** Функциональное, нефункциональное, тестирование пользовательского интерфейса
  - **Тест-документация:** Тест-кейсы, чек-листы, баг-репорты
  - **Инструменты:** Postman, SQL, Redash
  - **Языки:** Русский (родной), Английский (В1)

## Структура портфолио

### [Баг-репорты](/Bug-Reports)
Примеры оформления баг-репортов для Desktop Telegram:
- Баг #1: Успешно отправляется изображение размером более 10мб
- Баг #2: Корректно выполняется поиск по спец. символам
- Баг #3: Некорректный результат поиска по заданному слову в сообществе
- Баг #4: Не выполняется голосовой звонок через приложение
- Баг #5: Не выполняется видеозвонок через приложение

### [Тест-документация](/Test-Documentation)
Примеры тестовой документации для Desktop Telegram:
- Тест-план для проверки работы приложения (основные функции, баги, неосновной функционал)
- Чек-лист для проверки функции поиска 
- Чек-лист для проверки основных функций 
- Тест-кейсы для проверки функции поиска
- Тест-кейсы для проверки основных функций

### [SQL-запросы](/SQL)
Примеры запросов SQL для работы с данными:
- SELECT с сортировкой данных
- Функции фильтрации оператор WHERE
- Агрегирующие функции в запросе
- Применение группировки данных в запросе

### [API-тестирование](/API-Testing)
Примеры тестирования API через Postman:
- В процессе изучения


## Проекты

### Проект #1: Тестирование приложения Desktop Telegram
**Цель:** Проверить работу функций приложения 
**Что сделано:**
- Составлен тест-план для понимания общего концепта проверки приложения
- Составлен чек-лист из 23 пунктов
- Написано 23 тест-кейса
- Обнаружено и зафиксированн 5 багов (составлено 5 баг-репортов)
- Подготовка общего отчета о проделанной раьоте (*в процессе выполнения*)

### Проект #2: Изучение SQL для тестировщика (работа с БД)
**Цель:** Научиться писать запросы для выполнения запросов к БД
**Что сделано:**
- Освоены основные базовые запросы SELECT, FROM, ORDER BY, LIMIT
- Изучены возможности и функции фильтрации данных оператор WHERE
- Изучены основные функции агрегации данных DISTINCT, SUM, MIN, MAX, COUNT, AVG...
- Изучены основные функции фильтрации данных HAVING, CASE, FILTER...
- Решение практических задач на платформе Redash
- Функции подзапросов (*в процессе изучения*)

*Портфолио обновляется по мере изучения новых материалов*
